<!DOCTYPE doctype PUBLIC "-//w3c//dtd html 4.0 transitional//en">
<html>
<head>
                    
  <meta http-equiv="Content-Type"
 content="text/html; charset=iso-8859-1">
                    
  <meta name="GENERATOR"
 content="Mozilla/4.79 [en] (Windows NT 5.0; U) [Netscape]">
                    
  <meta name="ProgId" content="FrontPage.Editor.Document">
                    
  <meta name="Microsoft Border" content="tlb, default">
  <title>WebQuest: Criptograf&iacute;a</title>
                                 
  <script language="JavaScript" fptype="dynamicanimation">

  </script> 
             
  <script language="JavaScript1.2" fptype="dynamicanimation"
 src="animate.js">
  </script>             
  <script language="javascript">

function pop1(){  
     var  
     w=window.open("","resultado","toolbar=no,width=200,height=70,status=no,scrollbars=no,resize=no,menubar=no");  
     w.moveTo(0,0);  
     w.document.write("<html><body><br>");  
     w.document.write("<h4>");  
     w.document.write("<strong>Mensaje:</strong> Obtendré cien.");   
     w.document.write("</h4>");  
     w.document.write("</body><html>");  
     }  



function pop2(){  
     var w =window.open("","resultado","toolbar=no,width=200,height=70,status=no,scrollbars=no,resize=no,menubar=no");  
     w.moveTo(0,0);  
     w.document.write("<html><body><br>");  
     w.document.write("<h4>");  
     w.document.write("<strong>Mensaje cifrado:</strong> 'wgepqekñfñr_hfffsa'");   
     w.document.write("</h4>");  
     w.document.write("</body><html>");  
     } 


  </script>
</head>
  <body background="backg.gif" bgproperties="fixed" ="" leftmargin="0"
 marginwidth="0" topmargin="0" marginheight="0">
     <!--msnavigation--> <br>
    <!--msnavigation-->    
<table border="0" cellspacing="0" cellpadding="0" width="100%">
     <caption><br>
      </caption><tbody>
                 
  </tbody>  <tbody>
        <tr>
     <td><img src="gildedage.gif" border="0" height="93" width="600">
          </td>
     </tr>
                 
  </tbody>    
</table>
     <!--msnavigation--> <br>
    <!--msnavigation-->    
<table border="0" cellspacing="0" cellpadding="0" width="100%">
     <caption><br>
      </caption><tbody>
                 
  </tbody>  <tbody>
        <tr>
     <td valign="top" width="1%"> <br>
                               
      <table border="0" cellspacing="5" cellpadding="0" width="110">
     <caption><br>
            </caption><tbody>
                                         
        </tbody>  <tbody>
              <tr>
     <td><a href="index.htm"
 onmouseover="document['fpAnimswapImgFP44'].imgRolln=document['fpAnimswapImgFP44'].src;document['fpAnimswapImgFP44'].src=document['fpAnimswapImgFP44'].lowsrc;"
 onmouseout="document['fpAnimswapImgFP44'].src=document['fpAnimswapImgFP44'].imgRolln">
               </a><br>
             </td>
     </tr>
      <tr>
     <td><a href="task.htm"
 onmouseover="document['fpAnimswapImgFP45'].imgRolln=document['fpAnimswapImgFP45'].src;document['fpAnimswapImgFP45'].src=document['fpAnimswapImgFP45'].lowsrc;"
 onmouseout="document['fpAnimswapImgFP45'].src=document['fpAnimswapImgFP45'].imgRolln">
               </a><br>
             </td>
     </tr>
      <tr>
     <td><a href="process.htm"
 onmouseover="document['fpAnimswapImgFP46'].imgRolln=document['fpAnimswapImgFP46'].src;document['fpAnimswapImgFP46'].src=document['fpAnimswapImgFP46'].lowsrc;"
 onmouseout="document['fpAnimswapImgFP46'].src=document['fpAnimswapImgFP46'].imgRolln">
               </a><br>
             </td>
     </tr>
      <tr>
     <td><a href="segment.htm"
 onmouseover="document['fpAnimswapImgFP47'].imgRolln=document['fpAnimswapImgFP47'].src;document['fpAnimswapImgFP47'].src=document['fpAnimswapImgFP47'].lowsrc;"
 onmouseout="document['fpAnimswapImgFP47'].src=document['fpAnimswapImgFP47'].imgRolln">
               </a><br>
             </td>
     </tr>
      <tr>
     <td><a href="roles.htm"
 onmouseover="document['fpAnimswapImgFP48'].imgRolln=document['fpAnimswapImgFP48'].src;document['fpAnimswapImgFP48'].src=document['fpAnimswapImgFP48'].lowsrc;"
 onmouseout="document['fpAnimswapImgFP48'].src=document['fpAnimswapImgFP48'].imgRolln">
               </a><br>
             </td>
     </tr>
      <tr>
     <td><a href="resources.htm"
 onmouseover="document['fpAnimswapImgFP49'].imgRolln=document['fpAnimswapImgFP49'].src;document['fpAnimswapImgFP49'].src=document['fpAnimswapImgFP49'].lowsrc;"
 onmouseout="document['fpAnimswapImgFP49'].src=document['fpAnimswapImgFP49'].imgRolln">
               </a><br>
             </td>
     </tr>
      <tr>
     <td><a href="evaluation.htm"
 onmouseover="document['fpAnimswapImgFP50'].imgRolln=document['fpAnimswapImgFP50'].src;document['fpAnimswapImgFP50'].src=document['fpAnimswapImgFP50'].lowsrc;"
 onmouseout="document['fpAnimswapImgFP50'].src=document['fpAnimswapImgFP50'].imgRolln">
               </a><br>
             </td>
     </tr>
      <tr>
     <td><a href="conclusion.htm"
 onmouseover="document['fpAnimswapImgFP51'].imgRolln=document['fpAnimswapImgFP51'].src;document['fpAnimswapImgFP51'].src=document['fpAnimswapImgFP51'].lowsrc;"
 onmouseout="document['fpAnimswapImgFP51'].src=document['fpAnimswapImgFP51'].imgRolln">
               </a><br>
             </td>
     </tr>
      <tr>
     <td>&nbsp;</td>
     </tr>
      <tr>
     <td>&nbsp;</td>
     </tr>
                                         
        </tbody>                            
      </table>
     </td>
      <td valign="top" width="24"><br>
          </td>
      <td><!--msnavigation--><br>
          </td>
      <td valign="top"> <br>
                               
      <table align="left" border="0" cellspacing="5" cellpadding="0"
 width="100%" height="100%">
     <caption><br>
            </caption><tbody>
                                         
        </tbody>  <tbody>
              <tr>
     <td valign="top" width="100%" height="100%"><br>
                <img src="titlega.jpg" alt="Recursion"
 naturalsizeflag="3" height="276" width="300" align="left">
     <br>
    El sistema de numeraci&oacute;n romana se desarroll&oacute; en la antigua 
  Roma y se utiliz&oacute; en todo su imperio. En este sistema las cifras 
se escriben en determinadas letras, que representan a los n&uacute;meros. 
Las letras son siempre may&uacute;sculas, ya que en el alfabeto romano no 
existen las min&uacute;sculas.                                          
          
            <p>Las equivalencias de los n&uacute;meros romanos con nuestro
  sistema decimal son las siguientes: <br>
    &nbsp; </p>
                                                       
            <center>                                                    
            <table border="1" cellspacing="0" cellpadding="0"
 width="30%">
     <tbody>
                    <tr align="center" bgcolor="#3366ff">
     <td><b><font color="#ffffff">Ar&aacute;bigos</font></b></td>
      <td><b><font color="#ffffff">Romanos</font></b></td>
     </tr>
      <tr>
     <td>1</td>
      <td>I</td>
     </tr>
      <tr>
     <td>5</td>
      <td>V</td>
     </tr>
      <tr>
     <td>10</td>
      <td>X</td>
     </tr>
      <tr>
     <td>50</td>
      <td>L</td>
     </tr>
      <tr>
     <td>100</td>
      <td>C</td>
     </tr>
      <tr>
     <td>500</td>
      <td>D</td>
     </tr>
      <tr>
     <td>1000</td>
      <td>M</td>
     </tr>
                                                                 
              </tbody>                                                  
 
            </table>
                </center>
                                                          
            <p>En el sistema de numeraci&oacute;n romano las letras deben
  situarse en orden de m&aacute;s valor a menos valor. No deben escribirse
 m&aacute;s de tres I, o tres X, o tres C seguidas. Si estas letras se sit&uacute;an
 delante de una V, una L, o una D, respectivamente, le restan su valor a
la  cifra de dichas letras. </p>
                                                       
            <p>Los romanos desconoc&iacute;an el cero, introducido posteriormente
  por los &aacute;rabes, de forma que no existe ninguna forma de representaci&oacute;n 
  de este valor. </p>
                                                       
            <p>Para cifras elevadas los romanos utilizaban un gui&oacute;n
  colocado encima de la letra correspondiente. El gui&oacute;n multiplicaba
  el valor de la letra por 1.000. Por ejemplo, una "C" con gui&oacute;n superior
  correspond&iacute;a al valor 100.000 (100 x 1.000), y una "M" con gui&oacute;n
  superior al valor 1.000.000 (1.000 x 1.000). Este m&eacute;todo permit&iacute;a
  escribir cifras realmente altas. <br>
    &nbsp; <br>
    &nbsp;Para convertir n&uacute;meros romanos en ar&aacute;bigos debe 
seguirse el siguiente procedimiento: </p>
                                                                        
                       
            <p>1) El n&uacute;mero romano se divide en millares, centenas,
  decenas y unidades. </p>
                                                       
            <p>Por ejemplo, para dividir el n&uacute;mero MCMXLV primero
observamos el n&uacute;mero de 'M' que hay al principio. En este caso solamente
hay una M, este n&uacute;mero representa a los millares.&nbsp; </p>
                                                       
            <p>En las centenas se pueden utilizar tres s&iacute;mbolos: la
  C representa 100 unidades, la D representa 500 unidades y la M representa
  1000 unidades (esta solamente se utiliza antecedida por una C, que significa
  que vamos a restar 100 unidades al 1000). En nuestro ejemplo debemos tomar
  CM como las centenas. </p>
                                                       
            <p>En las decenas tambi&eacute;n pueden aparecer tres s&iacute;mbolos: 
  la X representa 10 unidades, la L representa 50 unidades y la C representa 
  100 unidades (y solamente s utiliza antecedida de una X). En nuestro ejemplo 
  las decenas son XL. </p>
                                                       
            <p>Por &uacute;ltimo en las unidades tambi&eacute;n pueden aparecer
  solamente tres s&iacute;mbolos: La I representa 1 unidad, la V representa
  5 unidades y la X representa 10 unidades (y solamente se utiliza antecedida
  de la I). En nuestro ejemplo las unidades son VIII. </p>
                                                       
            <p>MCMXLVIII -&gt; M CM XL VIII<br>
                <br>
    Para poder dividir el n&uacute;mero en la computadora se utiliza un proceso
  que vaya revisando caracter por caracter. Siempre y cuando lo que encuentre
  sean M entonces se consideran millares. Una vez que el caracter sea diferente
  a M pasamos a las centenas. En las centenas pueden haber dos caracteres
especiales  (CM y CD) y si encontramos uno de estos terminan las centenas
o pueden haber  una D o de una a tres C, por lo tanto tenemos que revisar
hasta cuando dejan  de haber C y entonces habremos pasado a las decenas.
El proceso es el mismo  con todos los dem&aacute;s pero utilizando los s&iacute;mbolos
particulares  de cada uno (en las decenas utilizamos XL y XC como s&iacute;mbolos
especiales  y tenemos que contar hasta que no hayan X).<br>
     </p>
                                                       
            <p>2) Ahora debemos traducir cada una de las partes que dividimos
  y sumarlas para obtener la representaci&oacute;n en n&uacute;meros ar&aacute;bigos 
  del n&uacute;mero romano. El n&uacute;mero de 'M' que hayan en los millares 
  es el n&uacute;mero de miles que tiene nuestro n&uacute;mero ar&aacute;bigo 
  (es decir MMM = 3000, M = 1000). Esto mismo se repite con los s&iacute;mbolos 
  I, X y C que pueden repetirse y su valor se multiplica el n&uacute;mero 
de veces que aparezcan (CCC = 100 * 3 veces = 300). Como m&aacute;ximo pueden
  haber cuatro 'M' consecutivas y tres I, X o C consecutivas. Como en nuestro
  ejemplo solamente tenemos una M significa que vale <b><font
 color="#ff0000">1000 </font></b>unidades. </p>
                                                       
            <p>3) Ahora debemos revisar las centenas. Cuando las centenas
  son CM significa que a los mil que representa la M le vamos a restar los
 cien que representa la C. Por lo general, cuando una I, X o C antecede a
otro n&uacute;mero significa que vamos a restar el valor del primero al segundo.
  En este caso la M vale 1000 y la C vale cien por lo tanto restamos y tenemos
              <font color="#0000ff"><b>900 </b></font>unidades o 9 centenas. 
              </p>
                                                       
            <p>4) Al igual que en el caso de las centenas, la X antecediendo
  a la L significa que vamos a restar el valor de una a la otra. Como la
L  tiene el valor de 50 le restamos los 10 que vale X y el resultado queda
            <font color="#33cc00"><b>40</b></font>. </p>
                                                       
            <p>5) En las unidades sucede otro caso especial. Si alguna I,
  X o C est&aacute; despu&eacute;s de un n&uacute;mero significa que sus
valores   se van a sumar. En nuestro ejemplo, tres s&iacute;mbolos I est&aacute;n
despu&eacute;s  de un s&iacute;mbolo V. Como la I se repite tres veces significa
que va a valer tres veces su valor (que es 1) por lo tanto le vamos a sumar
3 a los 5 que tenemos por la V lo que nos da como resultado un <b><font
 color="#ff9900">8</font></b>. </p>
                                                       
            <p>6) Ahora sumamos los valores de cada una de las partes:&nbsp; 
              &nbsp; <br>
    &nbsp;             
            <table border="1" cellspacing="0" cellpadding="0" cols="2"
 width="20%">
     <tbody>
                    <tr>
     <td>M</td>
      <td align="right"><b><font color="#ff0000">1000</font></b></td>
     </tr>
      <tr>
     <td>CM</td>
      <td align="right"><font color="#0000ff"><b>900</b></font></td>
     </tr>
      <tr>
     <td>XL</td>
      <td align="right"><font color="#33cc00"><b>40</b></font></td>
     </tr>
      <tr>
     <td>VIII</td>
      <td align="right"><font color="#ff9900"><b>8</b></font></td>
     </tr>
      <tr>
     <td>Total:</td>
      <td align="right">1948</td>
     </tr>
                                                                 
              </tbody>                                                  
 
            </table>
      </p>
                                                       
            <p>El proceso inverso es muy sencillo. Empezamos dividiendo un
  n&uacute;mero ar&aacute;bigo en sus partes, por ejemplo 1743 lo dividimos
  en 1 millar, 7 centenas, 4 decenas y 3 unidades.<br>
                </p>
                                                       
            <p>1) Ahora tenemos que convertir cada uno de ests valores en
  su equivalente y unirlos. Primero debemos poner tantas M como hayan millares.
  (Por ejemplo, si nuestro n&uacute;mero fuera 4328 tenemos 4 millares y
debemos   poner 'MMMM'). En nuestro ejemplo tenemos un millar y por lo tanto
ponemos   una <b><font color="#ff0000">M</font></b>.<br>
                </p>
                                                       
            <p>2) Ahora tenemos que fijarnos en el n&uacute;mero de centenas.
 En las decenas hay dos s&iacute;mbolos que son aparte de todos los dem&aacute;s,
 el 4 y el 9 por lo tanto, si el n&uacute;mero de centenas es 4 o 9 &uacute;nicamente
 ponemos el s&iacute;mbolo (si es 4 ponemos  CD, si es nueve ponemos CM)
y  continuamos con las decenas. Si el n&uacute;mero  no era 4 ni 9 revisamos
 si es mayor o igual a 5 y entonces mandamos una D a la salida y restamos
5 al n&uacute;mero (es decir, si tengo el n&uacute;mero 8 tengo que mandar
una D a la salida y restarle 5 al n&uacute;mero 8, as&iacute; ue solamente
me quedar&iacute;an 3). Por &uacute;ltimo ponemos tantas C como nos queden
 centenas. En el ejemplo tenemos 7 centenas po lo tanto restamos 5 y ponemos
 la D. Ahora solamente nos quedan dos centenas y las llenamos con C y as&iacute; 
 nuestro n&uacute;mero queda <font color="#0000ff"><b>DCC</b></font><font
 color="#0000ff">.</font><br>
                </p>
                                                       
            <p>3) Para las decenas y las unidades se repite lo que sucede
  en las centenas, pero con los s&iacute;mbolos respectivos a decenas y unidades.Es
  decir, si as decenas son 4 o 9 ponemos el s&iacute;mbolo XL o XC respectivamente
  y pasamos a las unidades, en caso contrario si las decenas sean mayores
o  iguales a 5 restamos 5 y ponemos una L por &uacute;ltimo ponemos el n&uacute;mero
  que sobre de X (por ejemplo, si queremos poner 8 decenas primero restamos
  5 (y nos quedan solo 3 decenas) y ponemos una L, despu&eacute;s ponemos
3 X porque el n&uacute;mero de decenas es 3. En nuestro ejemplo el n&uacute;mero
  de decenas es 4, que es un n&uacute;mero especial por lo tanto ponemos
una               <font color="#33cc00"><b>XL</b></font> y pasamos con las
unidades.   Con las unidades se sigue el mismo proceso pero con los s&iacute;mbolos
de  las unidades. Por ejemplo, para hacer un 3 ponemos &uacute;nicamente
tres  I (nos queda <font color="#ff9900"><b>III</b></font>)<br>
                </p>
                                                       
            <p>4) Ahora solamente se unen las partes que sacamos por separado:
              <b><font color="#ff0000">M</font></b> <b><font
 color="#0000ff">DCC</font></b> <b><font color="#33cc00">XL</font></b> <b><font
 color="#ff9900">III</font></b> y nos queda MDCCXLIII.<br>
                </p>
                                                       
            <p>El objetivo de este WebQuest es leer un archivo, decidir si 
 los n&uacute;mreo son ar&aacute;bigos o romanos y convertir al otro tipo 
de numeraci&oacute;n sg&uacute;n sea el caso.&nbsp; </p>
                                                       
            <p><font face="Times New Roman, Times, serif"><b><i>Consideraciones
  finales</i></b>:</font> <br>
                <font face="Times New Roman, Times, serif">Tu proyecto deber&aacute; 
 pedir la localizaci&oacute;n del archivo a abrir. El archivo es un documento 
 de texto plano que contiene los n&uacute;meros en texto plano separados por
 cambio de l&iacute;nea ("\n"), </font><font
 face="Times New Roman, Times, serif">se tiene que ver que tipo de numeraci&oacute;n 
 es y convertir cada uno de los n&uacute;meros a la otra numeraci&oacute;n. 
 El resutado se debe guardar a otro archivo</font><font
 face="Times New Roman, Times, serif"> como se muestra en la siguiente foto:</font></p>
                                         
            <p><font face="Times New Roman, Times, serif">             <img
 src="archivo.jpg" alt="Ejemplo de archivos" width="603" height="280">
                <br>
                </font></p>
                                                       
            <p><font face="Times New Roman, Times, serif"> En el caso de un
archivo con n&uacute;meros romanos, todos los n&uacute;meros que vienen en
el archivo son n&uacute;meros romanos v&aacute;lidos, ya que el algoritmo 
 que nos permite validar un n&uacute;mero romano es muy complicado para el 
 alcance de esta clase; y todos los n&uacute;meros ser&aacute;n menores a 
4000 ya que no hay manera de representar los guiones superiores mediante caracteres
ascii. Por lo tanto para los n&uacute;meros romanos la &uacute;nica consideraci&oacute;n
que se debe tomar es que los n&uacute;meros pueden estar escritos con min&uacute;sculas
o may&uacute;sculas (VIII = vIiI = viii). En caso que los n&uacute;meros
sean ar&aacute;bigos el programa debe validar que los n&uacute;meros sean
menores al 4000 y debe escribir el n&uacute;mero romano resultante con puras
mayusculas.<br>
                </font></p>
                                                                    
            <p><font face="Times New Roman, Times, serif">Puedes guiarte
con este <a href="esquema.jpg" style="font-style: italic;">esquema de trabajo</a>
  para que tengas una idea de como debe funcionar tu programa.</font></p>
                </td>
     </tr>
                                         
        </tbody>                            
      </table>
      <br>
    &nbsp;&nbsp;                             
      <p><!--msnavigation--></p>
          </td>
     </tr>
                 
  </tbody>    
</table>
     <!--msnavigation--> <!--msnavigation-->    
<table border="0" cellspacing="0" cellpadding="0" width="100%">
     <caption><br>
      </caption><tbody>
                 
  </tbody>  <tbody>
        <tr>
         </tr>
                 
  </tbody>    
</table>
       <br>
</body>
</html>
